ngocuong86/GY_BM280_STM32F4x/Src/Mid/BME280-pressure-temperature-sensor/BME280-pressure-temperature-sensor.c
/*******************************************************************************
 *				 _ _                                             _ _
				|   |                                           (_ _)
				|   |        _ _     _ _   _ _ _ _ _ _ _ _ _ _   _ _
				|   |       |   |   |   | |    _ _     _ _    | |   |
				|   |       |   |   |   | |   |   |   |   |   | |   |
				|   |       |   |   |   | |   |   |   |   |   | |   |
				|   |_ _ _  |   |_ _|   | |   |   |   |   |   | |   |
				|_ _ _ _ _| |_ _ _ _ _ _| |_ _|   |_ _|   |_ _| |_ _|
								(C)2022 Lumi
 * Copyright (c) 2022
 * Lumi, JSC.
 * All Rights Reserved
 *
 * File name: temperature-pressure-altitude.h
 *
 * Description:
 *
 * Author: CuongNV
 *
 * Last Changed By:  $Author: cuongnv $
 * Revision:         $Revision: $
 * Last Changed:     $Date: $Jul 15, 2022
 ******************************************************************************/

/******************************************************************************/
/*                              INCLUDE FILES                                 */
/******************************************************************************/
#include <math.h>
#include <stdio.h>
#include "stm32f401re_gpio.h"
#include "stm32f401re_rcc.h"
#include "stm32f401re_i2c.h"
#include "stm32f401re_spi.h"
#include "../../Driver/I2C1-Interface/I2C1-Interface.h"
#include "../../Driver/SPI1-Interface/SPI1-Interface.h"
#include "BME280-pressure-temperature-sensor.h"
/******************************************************************************/
/*                     PRIVATE TYPES and DEFINITIONS                         */
/******************************************************************************/
#define I2C_MODE 0
#define SPI_MODE 1

//Register names:
#define BME280_DIGT1_LSB_REG			0x88
#define BME280_DIGT1_MSB_REG			0x89
#define BME280_DIGT2_LSB_REG			0x8A
#define BME280_DIGT2_MSB_REG			0x8B
#define BME280_DIGT3_LSB_REG			0x8C
#define BME280_DIGT3_MSB_REG			0x8D
#define BME280_DIGP1_LSB_REG			0x8E
#define BME280_DIGP1_MSB_REG			0x8F
#define BME280_DIGP2_LSB_REG			0x90
#define BME280_DIGP2_MSB_REG			0x91
#define BME280_DIGP3_LSB_REG			0x92
#define BME280_DIGP3_MSB_REG			0x93
#define BME280_DIGP4_LSB_REG			0x94
#define BME280_DIGP4_MSB_REG			0x95
#define BME280_DIGP5_LSB_REG			0x96
#define BME280_DIGP5_MSB_REG			0x97
#define BME280_DIGP6_LSB_REG			0x98
#define BME280_DIGP6_MSB_REG			0x99
#define BME280_DIGP7_LSB_REG			0x9A
#define BME280_DIGP7_MSB_REG			0x9B
#define BME280_DIGP8_LSB_REG			0x9C
#define BME280_DIGP8_MSB_REG			0x9D
#define BME280_DIGP9_LSB_REG			0x9E
#define BME280_DIGP9_MSB_REG			0x9F
#define BME280_DIGH1_REG				0xA1
#define BME280_CHIP_ID_REG				0xD0 //Chip ID
#define BME280_RST_REG					0xE0 //Softreset Reg
#define BME280_DIGH2_LSB_REG			0xE1
#define BME280_DIGH2_MSB_REG			0xE2
#define BME280_DIGH3_REG				0xE3
#define BME280_DIGH4_MSB_REG			0xE4
#define BME280_DIGH4_LSB_REG			0xE5
#define BME280_DIGH5_MSB_REG			0xE6
#define BME280_DIGH6_REG				0xE7
#define BME280_CTRL_HUMIDITY_REG		0xF2 //Ctrl Humidity Reg
#define BME280_STAT_REG					0xF3 //Status Reg
#define BME280_CTRL_MEAS_REG			0xF4 //Ctrl Measure Reg
#define BME280_CONFIG_REG				0xF5 //Configuration Reg
#define BME280_MEASUREMENTS_REG			0xF7 //Measurements register start
#define BME280_PRESSURE_MSB_REG			0xF7 //Pressure MSB
#define BME280_PRESSURE_LSB_REG			0xF8 //Pressure LSB
#define BME280_PRESSURE_XLSB_REG		0xF9 //Pressure XLSB
#define BME280_TEMPERATURE_MSB_REG		0xFA //Temperature MSB
#define BME280_TEMPERATURE_LSB_REG		0xFB //Temperature LSB
#define BME280_TEMPERATURE_XLSB_REG		0xFC //Temperature XLSB
#define BME280_HUMIDITY_MSB_REG			0xFD //Humidity MSB
#define BME280_HUMIDITY_LSB_REG			0xFE //Humidity LSB


#define SENSOR_I2C_ADDRESS 				0x77
#define SENSOR_SPI_ADDRESS				0x7F


typedef struct
{
	u16_t byDigT1;
	i16_t ibDigT2;
	i16_t ibDigT3;

	u16_t byDigP1;
	i16_t ibDigP2;
	i16_t ibDigP3;
	i16_t ibDigP4;
	i16_t ibDigP5;
	i16_t ibDigP6;
	i16_t ibDigP7;
	i16_t ibDigP8;
	i16_t ibDigP9;

	u8_t byDigH1;
	i16_t ibDigH2;
	u8_t byDigH3;
	i16_t ibDigH4;
	i16_t ibDigH5;
	i8_t ibDigH6;

}SensorCalibration_t;
typedef struct
{


	//Main ierface and mode g_SensorSettings
    u8_t byComInterface;
    u8_t byI2CAddress;
    u8_t byChipSelectPin;
	//Deprecated g_SensorSettings
	u8_t byRunMode;
	u8_t byTimeStandby;
	u8_t byFilter;
	u8_t byTempOverSample;
	u8_t byPressOverSample;
	u8_t byHumidOverSample;
    u32_t fTempCorrection; // correction of temperature - added to the result
}BME280SensorSetting_t;

enum {
    SAMPLING_NONE = 0b000,
    SAMPLING_X1 = 0b001,
    SAMPLING_X2 = 0b010,
    SAMPLING_X4 = 0b011,
    SAMPLING_X8 = 0b100,
    SAMPLING_X16 = 0b101
  }SensorSampling;

  /**************************************************************************/
  /*!
      @brief  power modes
  */
  /**************************************************************************/
  enum{
    MODE_SLEEP = 0b00,
    MODE_FORCED = 0b01,
    MODE_NORMAL = 0b11
  }SensorMode;

  /**************************************************************************/
  /*!
      @brief  filter values
  */
  /**************************************************************************/
  enum {
    FILTER_OFF = 0b000,
    FILTER_X2 = 0b001,
    FILTER_X4 = 0b010,
    FILTER_X8 = 0b011,
    FILTER_X16 = 0b100
  }SensorFilter;

  /**************************************************************************/
  /*!
      @brief  standby duration in ms
  */
  /**************************************************************************/
  enum {
    STANDBY_MS_0_5 = 0b000,
    STANDBY_MS_10 = 0b110,
    STANDBY_MS_20 = 0b111,
    STANDBY_MS_62_5 = 0b001,
    STANDBY_MS_125 = 0b010,
    STANDBY_MS_250 = 0b011,
    STANDBY_MS_500 = 0b100,
    STANDBY_MS_1000 = 0b101
  }StandbyDuration;
  enum{
	  ZERO_SAMPLE_VALUE = 0,
	  ONE_SAMPLE_VALUE = 1,
	  TWO_SAMPLE_VALUE = 2,
	  FOUR_SAMPLE_VALUE = 4,
	  EIGHT_SAMPLE_VALUE = 8,
	  SIXTEEN_SAMPLE_VALUE = 16
  }SensorValueSample;
/******************************************************************************/
/*                              PRIVATE DATA                                  */
/******************************************************************************/

/******************************************************************************/
/*                              EXPORTED DATA                                 */
/******************************************************************************/

/******************************************************************************/
/*                            PRIVATE FUNCTIONS                               */
/******************************************************************************/
static u8_t getMode(void_t); //Get the current mode: sleep, forced, or normal
static void_t setMode(u8_t byMode); //Set the current mode
//ReadRegisterRegion takes a u8 array address as input and reads
//a chunk of memory io that array.
static void_t readRegisterRegion(u8_t*, u8_t, u8_t );
//readRegister reads one register
static u8_t readRegister(u8_t);
//Reads two regs, LSByte then MSByte order, and concatenates them
//Used for two-byte reads
static u16_t readRegisterInt16( u8_t byOffset );
//Writes a byte;
static void_t writeRegister(u8_t, u8_t);

static u8_t checkSampleValue(u8_t byUserValue); //Checks for valid over sample values
/******************************************************************************/
/*                            EXPORTED FUNCTIONS                              */
/******************************************************************************/

/******************************************************************************/
/******************************************************************************/
/*                     EXPORTED TYPES and DEFINITIONS                         */
/******************************************************************************/
/******************************************************************************/
/*                              PRIVATE DATA                                  */
/******************************************************************************/
float_t g_fReferencePressure = 101325;
BME280SensorSetting_t g_SensorSettings;
SensorCalibration_t g_Calibration;
float_t g_fTempfine;

