ngocuong86/GY_BM280_STM32F4x/Src/Mid/BME280-pressure-temperature-sensor/BME280-pressure-temperature-sensor.c
/******************************************************************************
* @func					BMP280_Init
* @brief				This func Init BMP280_Init
* @param				none
* @return				ChipID
* @Note					none
*/
u8_t BMP280_Init(void_t){
//	g_SensorSettings.chipSelectPin = 10; //Select CS pin for SPI

	//These are deprecated g_SensorSettings
	g_SensorSettings.byRunMode = 3; //Normal/Run
	g_SensorSettings.byTimeStandby = 0; //0.5ms
	g_SensorSettings.byFilter = 0; //Filter off
	g_SensorSettings.byTempOverSample = 1;
	g_SensorSettings.byPressOverSample = 1;
	g_SensorSettings.byHumidOverSample = 1;
	g_SensorSettings.fTempCorrection = 0.f; // correction of temperature - added to the result

	//Reading all compensation data, range 0x88:A1, 0xE1:E7
	g_Calibration.byDigT1 = ((u16_t)((readRegister(BME280_DIGT1_MSB_REG) << 8) + readRegister(BME280_DIGT1_LSB_REG)));
	g_Calibration.ibDigT2 = ((i16_t)((readRegister(BME280_DIGT2_MSB_REG) << 8) + readRegister(BME280_DIGT2_LSB_REG)));
	g_Calibration.ibDigT3 = ((i16_t)((readRegister(BME280_DIGT3_MSB_REG) << 8) + readRegister(BME280_DIGT3_LSB_REG)));

	g_Calibration.byDigP1 = ((u16_t)((readRegister(BME280_DIGP1_MSB_REG) << 8) + readRegister(BME280_DIGP1_LSB_REG)));
	g_Calibration.ibDigP2 = ((i16_t)((readRegister(BME280_DIGP2_MSB_REG) << 8) + readRegister(BME280_DIGP2_LSB_REG)));
	g_Calibration.ibDigP3 = ((i16_t)((readRegister(BME280_DIGP3_MSB_REG) << 8) + readRegister(BME280_DIGP3_LSB_REG)));
	g_Calibration.ibDigP4 = ((i16_t)((readRegister(BME280_DIGP4_MSB_REG) << 8) + readRegister(BME280_DIGP4_LSB_REG)));
	g_Calibration.ibDigP5 = ((i16_t)((readRegister(BME280_DIGP5_MSB_REG) << 8) + readRegister(BME280_DIGP5_LSB_REG)));
	g_Calibration.ibDigP6 = ((i16_t)((readRegister(BME280_DIGP6_MSB_REG) << 8) + readRegister(BME280_DIGP6_LSB_REG)));
	g_Calibration.ibDigP7 = ((i16_t)((readRegister(BME280_DIGP7_MSB_REG) << 8) + readRegister(BME280_DIGP7_LSB_REG)));
	g_Calibration.ibDigP8 = ((i16_t)((readRegister(BME280_DIGP8_MSB_REG) << 8) + readRegister(BME280_DIGP8_LSB_REG)));
	g_Calibration.ibDigP9 = ((i16_t)((readRegister(BME280_DIGP9_MSB_REG) << 8) + readRegister(BME280_DIGP9_LSB_REG)));

	g_Calibration.byDigH1 = ((u8_t)(readRegister(BME280_DIGH1_REG)));
	g_Calibration.ibDigH2 = ((i16_t)((readRegister(BME280_DIGH2_MSB_REG) << 8) + readRegister(BME280_DIGH2_LSB_REG)));
	g_Calibration.byDigH3 = ((u8_t)(readRegister(BME280_DIGH3_REG)));
	g_Calibration.ibDigH4 = ((i16_t)((readRegister(BME280_DIGH4_MSB_REG) << 4) + (readRegister(BME280_DIGH4_LSB_REG) & 0x0F)));
	g_Calibration.ibDigH5 = ((i16_t)((readRegister(BME280_DIGH5_MSB_REG) << 4) + ((readRegister(BME280_DIGH4_LSB_REG) >> 4) & 0x0F)));
	g_Calibration.ibDigH6 = ((i8_t)readRegister(BME280_DIGH6_REG));

	//Most of the time the sensor will be init with default values
	//But in case user has old/deprecated code, use the settings.x values
	setStandbyTime(g_SensorSettings.byTimeStandby);
	setFilter(g_SensorSettings.byFilter);
	setPressureOverSample(g_SensorSettings.byPressOverSample); //Default of 1x oversample
	setHumidityOverSample(g_SensorSettings.byHumidOverSample); //Default of 1x oversample
	setTempOverSample(g_SensorSettings.byTempOverSample); //Default of 1x oversample

	setMode(MODE_NORMAL); //Go!

	return(readRegister(BME280_CHIP_ID_REG)); //Should return 0x60
}
/******************************************************************************
* @func					beginWithI2C
* @brief				This func begin with I2C interface
* @param				none
* @return				TRUE or FALSE
* @Note					none
*/
bool_t beginWithI2C(){
	I2C1_Init();
	g_SensorSettings.byComInterface = I2C_MODE; //Default to I2C
	g_SensorSettings.byI2CAddress = SENSOR_I2C_ADDRESS; //Default, jumper open is 0x77
	u8_t byChipID = BMP280_Init();
	if(byChipID == 0x58) return(TRUE); //Begin normal init with these settings. Should return chip ID of 0x58 for BMP
	if(byChipID == 0x60) return(TRUE); //Begin normal init with these settings. Should return chip ID of 0x60 for BME
	return(FALSE);
}
/******************************************************************************
* @func					beginWithSPI
* @brief				This func begin with SPI interface
* @param				none
* @return				TRUE or FALSE
* @Note					none
*/
bool_t beginWithSPI(){
	SPI1_Init();
	g_SensorSettings.byComInterface = SPI_MODE; //Default to I2C
	g_SensorSettings.byI2CAddress = SENSOR_SPI_ADDRESS; //Default, jumper open is 0x77
	u8_t byChipID = BMP280_Init();
	if(byChipID == 0x58) return(TRUE); //Begin normal init with these settings. Should return chip ID of 0x58 for BMP
	if(byChipID == 0x60) return(TRUE); //Begin normal init with these settings. Should return chip ID of 0x60 for BME
	return(FALSE);
}
/******************************************************************************
* @func					setMode
* @brief				This func setmode
* @param				u8_t byMode( sleep, force, normal)
* @return				none
* @Note					none
*/
static void_t setMode(u8_t byMode){
	if(byMode > MODE_NORMAL) byMode = 0; //Error check. Default to sleep mode

	u8_t byControlData = readRegister(BME280_CTRL_MEAS_REG);
	byControlData &= ~( (1<<1) | (1<<0) ); //Clear the mode[1:0] bits
	byControlData |= byMode; //Set
	writeRegister(BME280_CTRL_MEAS_REG, byControlData);
}
/******************************************************************************
* @func					getMode
* @brief				This func get Mode (slepp, force, normal)
* @param				none
* @return				Mode sleep or force or normal
* @Note					none
*/
static u8_t getMode(void_t){
	u8_t byControlData = readRegister(BME280_CTRL_MEAS_REG);
	return(byControlData & 0b00000011); //Clear bits 7 through 2
}
/******************************************************************************
* @func					setStandbyTime
* @brief				This func set stand time
* @param				u8_t byTimeSetting
//  0, 0.5ms
//  1, 62.5ms
//  2, 125ms
//  3, 250ms
//  4, 500ms
//  5, 1000ms
//  6, 10ms
//  7, 20ms
* @return				none
* @Note					none
*/
void_t setStandbyTime(u8_t byTimeSetting){
	if(byTimeSetting > STANDBY_MS_20) byTimeSetting = 0; //Error check. Default to 0.5ms

	u8_t byControlData = readRegister(BME280_CONFIG_REG);
	byControlData &= ~( (1<<7) | (1<<6) | (1<<5) ); //Clear the 7/6/5 bits
	byControlData |= (byTimeSetting << 5); //Align with bits 7/6/5
	writeRegister(BME280_CONFIG_REG, byControlData);
}
/******************************************************************************
* @func					setFilter
* @brief				This func set value filter
* @param				u8_t byFilterSetting
/  0, filter off
//  1, coefficients = 2
//  2, coefficients = 4
//  3, coefficients = 8
//  4, coefficients = 16
* @return				none
* @Note					none
*/
void_t setFilter(u8_t byFilterSetting){
	if(byFilterSetting > FILTER_X16) byFilterSetting = 0; //Error check. Default to filter off

	u8_t byControlData = readRegister(BME280_CONFIG_REG);
	byControlData &= ~( (1<<4) | (1<<3) | (1<<2) ); //Clear the 4/3/2 bits
	byControlData |= (byFilterSetting << 2); //Align with bits 4/3/2
	writeRegister(BME280_CONFIG_REG, byControlData);
}
/******************************************************************************
* @func					setTempOverSample
* @brief				This func set Oversamping for Meas Temperature
* @param				u8_t byOverSampleAmount
* @return				none
* @Note					none
*/
void_t setTempOverSample(u8_t byOverSampleAmount){
	byOverSampleAmount = checkSampleValue(byOverSampleAmount); //Error check

