ngocuong86/GY_BM280_STM32F4x/Src/Mid/BME280-pressure-temperature-sensor/BME280-pressure-temperature-sensor.c
	u8_t byOriginalMode = getMode(); //Get the current mode so we can go back to it at the end

	setMode(MODE_SLEEP); //Config will only be writeable in sleep mode, so first go to sleep mode

	//Set the osrs_t bits (7, 6, 5) to overSampleAmount
	u8_t byControlData = readRegister(BME280_CTRL_MEAS_REG);
	byControlData &= ~( (1<<7) | (1<<6) | (1<<5) ); //Clear bits 765
	byControlData |= byOverSampleAmount << 5; //Align overSampleAmount to bits 7/6/5
	writeRegister(BME280_CTRL_MEAS_REG, byControlData);

	setMode(byOriginalMode); //Return to the original user's choice
}
/******************************************************************************
* @func					setPressureOverSample
* @brief				This func set Oversamping for Meas Pressure
* @param				u8_t byOverSampleAmount
* @return				none
* @Note					none
*/
void_t setPressureOverSample(u8_t byOverSampleAmount)
{
	byOverSampleAmount = checkSampleValue(byOverSampleAmount); //Error check

	u8_t byOriginalMode = getMode(); //Get the current mode so we can go back to it at the end

	setMode(MODE_SLEEP); //Config will only be writeable in sleep mode, so first go to sleep mode

	//Set the osrs_p bits (4, 3, 2) to overSampleAmount
	u8_t byControlData = readRegister(BME280_CTRL_MEAS_REG);
	byControlData &= ~( (1<<4) | (1<<3) | (1<<2) ); //Clear bits 432
	byControlData |= byOverSampleAmount << 2; //Align overSampleAmount to bits 4/3/2
	writeRegister(BME280_CTRL_MEAS_REG, byControlData);

	setMode(byOriginalMode); //Return to the original user's choice
}
/******************************************************************************
* @func					setPressureOverSample
* @brief				This func set Oversamping for Meas Humi
* @param				u8_t byOverSampleAmount
* @return				none
* @Note					none
*/
void_t setHumidityOverSample(u8_t byOverSampleAmount)
{
	byOverSampleAmount = checkSampleValue(byOverSampleAmount); //Error check

	u8_t byOriginalMode = getMode(); //Get the current mode so we can go back to it at the end

	setMode(MODE_SLEEP); //Config will only be writeable in sleep mode, so first go to sleep mode

	//Set the osrs_h bits (2, 1, 0) to overSampleAmount
	u8_t byControlData = readRegister(BME280_CTRL_HUMIDITY_REG);
	byControlData &= ~( (1<<2) | (1<<1) | (1<<0) ); //Clear bits 2/1/0
	byControlData |= byOverSampleAmount << 0; //Align overSampleAmount to bits 2/1/0
	writeRegister(BME280_CTRL_HUMIDITY_REG, byControlData);

	setMode(byOriginalMode); //Return to the original user's choice
}

/******************************************************************************
* @func					checkSampleValue
* @brief				This func check Validates an over sample value
* 						These are used in the humidty, pressure, and temp oversample functions
* @param				u8_t byUserValue (Allowed values are 0 to 16)
* @return				Value Sample
* @Note					none
*/

static u8_t checkSampleValue(u8_t byUserValue)
{
	switch(byUserValue)
	{
		case(ZERO_SAMPLE_VALUE):
			return 0;
			break; //Valid
		case(ONE_SAMPLE_VALUE):
			return 1;
			break; //Valid
		case(TWO_SAMPLE_VALUE):
			return 2;
			break; //Valid
		case(FOUR_SAMPLE_VALUE):
			return 3;
			break; //Valid
		case(EIGHT_SAMPLE_VALUE):
			return 4;
			break; //Valid
		case(SIXTEEN_SAMPLE_VALUE):
			return 5;
			break; //Valid
		default:
			return 1; //Default to 1x
			break; //Good
	}
}
/******************************************************************************
* @func					setI2CAddress
* @brief				Set the global setting for the I2C address we want to communicate with
						Default is 0x77
* @param				u8_t byI2CAddress
* @return				none
* @Note					none
*/

void_t setI2CAddress(u8_t byI2CAddress)
{
	g_SensorSettings.byI2CAddress = byI2CAddress; //Set the I2C address for this device
}
/******************************************************************************
* @func					isMeasuring
* @brief				this func determine state meas
* @param				none
* @return				TRUE or FALSE
* @Note					none
*/
bool_t isMeasuring(void_t)
{
	u8_t byStat = readRegister(BME280_STAT_REG);
	return(byStat & (1<<3)); //If the measuring bit (3) is set, return true
}
/******************************************************************************
* @func					reset
* @brief				this func reset
* @param				none
* @return				none
* @Note					none
*/
void_t reset( void_t )
{
	writeRegister(BME280_RST_REG, 0xB6);

}
/******************************************************************************
* @func					readAllMeasurements
* @brief				this func read all value ( press, temp, humi)
* @param				BME280SensorMeasurements_t *pmeasurements (press, temp, humi)
* 						u8_t byTempScale (C, F)
* @return				none
* @Note					none
*/
void_t readAllMeasurements(BME280SensorMeasurements_t *pmeasurements, u8_t byTempScale){

	u8_t byDataBurst[8];
	readRegisterRegion(byDataBurst, BME280_MEASUREMENTS_REG, 8);

	if(byTempScale == 0){
		readTempCFromBurst(byDataBurst, pmeasurements);
	}else{
		readTempFFromBurst(byDataBurst, pmeasurements);
	}
	readFloatPressureFromBurst(byDataBurst, pmeasurements);
	readFloatHumidityFromBurst(byDataBurst, pmeasurements);
}
/******************************************************************************
* @func					readIntPressure
* @brief				this func read value pressure with data type float
* @param				none
* @return				Value Pressure mPa
* @Note					none
*/
u64_t readIntPressure(void_t )
{

	// Returns pressure in Pa as unsigned 32 bit ieger in Q24.8 format (24 ieger bits and 8 fractional bits).
	// Output value of “24674867” represents 24674867/256 = 96386.2 Pa = 963.862 hPa
    u8_t byBuffer[3];
    float_t fValuePress  = 0;
	readRegisterRegion(byBuffer, BME280_PRESSURE_MSB_REG, 3);
    i32_t adc_P = ((u32_t)byBuffer[0] << 12) | ((u32_t)byBuffer[1] << 4) | ((byBuffer[2] >> 4) & 0x0F);
//
	i64_t ibVar1, ibVar2, ibPressADC;
	ibVar1 = ((i64_t)g_fTempfine) - 128000;
	ibVar2 = ibVar1 * ibVar1 * (i64_t)g_Calibration.ibDigP6;
	ibVar2 = ibVar2 + ((ibVar1 * (i64_t)g_Calibration.ibDigP5)<<17);
	ibVar2 = ibVar2 + (((i64_t)g_Calibration.ibDigP4)<<35);
	ibVar1 = ((ibVar1 * ibVar1 * (i64_t)g_Calibration.ibDigP3)>>8) + ((ibVar1 * (i64_t)g_Calibration.ibDigP2)<<12);
	ibVar1 = (((((i64_t)1)<<47)+ibVar1))*((i64_t)g_Calibration.byDigP1)>>33;
	if (ibVar1 == 0)
	{
		return 0; // avoid exception caused by division by zero
	}
	ibPressADC = 1048576 - adc_P;
	ibPressADC = (((ibPressADC<<31) - ibVar2)*3125)/ibVar1;
	ibVar1 = (((i64_t)g_Calibration.ibDigP9) * (ibPressADC>>13) * (ibPressADC>>13)) >> 25;
	ibVar2 = (((i64_t)g_Calibration.ibDigP8) * ibPressADC) >> 19;
	ibPressADC = ((ibPressADC + ibVar1 + ibVar2) >> 8) + (((i64_t)g_Calibration.ibDigP7)<<4);
	fValuePress = ((float_t)ibPressADC / (256.0*100.0))*10000;
	return (u64_t)fValuePress;

