ngocuong86/GY_BM280_STM32F4x/Src/Mid/BME280-pressure-temperature-sensor/BME280-pressure-temperature-sensor.c
}
/******************************************************************************
* @func					readFloatPressureFromBurst
* @brief				this func read value pressure burst with data type float
* @param				u8_t byBuffer[],
* 						BME280SensorMeasurements_t *pmeasurements
* @return				none
* @Note					none
*/
void_t readFloatPressureFromBurst(u8_t byBuffer[], BME280SensorMeasurements_t *pmeasurements)
{

	// Set pressure in Pa as unsigned 32 bit integer in Q24.8 format (24 integer bits and 8 fractional bits).
	// Output value of “24674867” represents 24674867/256 = 96386.2 Pa = 963.862 hPa

	i32_t adc_P = ((u32_t)byBuffer[0] << 12) | ((u32_t)byBuffer[1] << 4) | ((byBuffer[2] >> 4) & 0x0F);

	i64_t byVar1, byVar2, byPressADC;
	byVar1 = ((i64_t)g_fTempfine) - 128000;
	byVar2 = byVar1 * byVar1 * (i64_t)g_Calibration.ibDigP6;
	byVar2 = byVar2 + ((byVar1 * (i64_t)g_Calibration.ibDigP5)<<17);
	byVar2 = byVar2 + (((i64_t)g_Calibration.ibDigP4)<<35);
	byVar1 = ((byVar1 * byVar1 * (i64_t)g_Calibration.ibDigP3)>>8) + ((byVar1 * (i64_t)g_Calibration.ibDigP2)<<12);
	byVar1 = (((((i64_t)1)<<47)+byVar1))*((i64_t)g_Calibration.byDigP1)>>33;
	if (byVar1 == 0)
	{
		pmeasurements->fPressure = 0; // avoid exception caused by division by zero
	}
	else
	{
		byPressADC = 1048576 - adc_P;
		byPressADC = (((byPressADC<<31) - byVar2)*3125)/byVar1;
		byVar1 = (((i64_t)g_Calibration.ibDigP9) * (byPressADC>>13) * (byPressADC>>13)) >> 25;
		byVar2 = (((i64_t)g_Calibration.ibDigP8) * byPressADC) >> 19;
		byPressADC = ((byPressADC + byVar1 + byVar2) >> 8) + (((i64_t)g_Calibration.ibDigP7)<<4);

		pmeasurements->fPressure = (float_t)byPressADC / 256.0;
	}
}
/******************************************************************************
* @func					setReferencePressure
* @brief				this func set reference Pressure Value
* @param				float_t fRefPressure
* @return				none
* @Note					none
*/
void_t setReferencePressure(float_t fRefPressure)
{
	g_fReferencePressure = fRefPressure;
}
/******************************************************************************
* @func					getReferencePressure
* @brief				this func get reference pressure
* @param				none
* @return				Reference Pressure
* @Note					none
*/
float_t getReferencePressure()
{
	return g_fReferencePressure;
}
/******************************************************************************
* @func					readFloatAltitudeMeters
* @brief				this func read value altitude with unit of meas is meters
* @param				none
* @return				Value Altitude (cm)
* @Note					none
*/
u64_t readIntAltitudeMeters(void_t)
{
  // Getting height from a pressure reading is called the "international barometric height formula".
  // The magic value of 44330.77 was adjusted in issue #30.
  // There's also some discussion of it here: https://www.sparkfun.com/tutorials/253
  // This calculation is NOT designed to work on non-Earthlike planets such as Mars or Venus;
  // see NRLMSISE-00. That's why it is the "international" formula, not "interplanetary".
  // Sparkfun is not liable for incorrect altitude calculations from this
  // code on those planets. Interplanetary selfies are welcome, however.
	float_t fValueAlti;
	float_t fValuePress =(float_t)((u64_t)readIntPressure()/100);
	//fValueAlti = (float_t)((g_fReferencePressure - fValuePress)/11.11)*100;// For every 1m height, Pressure lose 11.11 Pa
	fValueAlti = ((float_t)44330.77* (float_t)((float_t)1-pow((float_t)(fValuePress/g_fReferencePressure), (float_t)(1/5.255))))*100;
	return (u64_t)fValueAlti;
}
/******************************************************************************
* @func					readIntAltitudeFeet
* @brief				this func read value altitude with unit of meas is feet
* @param				none
* @return				Value Altitude (mF)
* @Note					none
*/
u64_t readIntAltitudeFeet( void_t )
{
	float_t fHeightOutput = 0;

	fHeightOutput = (readIntAltitudeMeters() * 3.28084)*100;
	return (u64_t)fHeightOutput;
}
/******************************************************************************
* @func					readIntHumidity
* @brief				this func read value humidity
* @param				none
* @return				Value Humdity (%%)
* @Note					none
*/
u64_t readIntHumidity( void_t )
{

	// Returns humidity in %RH as unsigned 32 bit integer in Q22. 10 format (22 integer and 10 fractional bits).
	// Output value of “47445” represents 47445/1024 = 46. 333 %RH
    u8_t byBuffer[2];
    float_t fValueHum = 0;
	readRegisterRegion(byBuffer, BME280_HUMIDITY_MSB_REG, 2);
    i32_t ibHumADC = ((u32_t)byBuffer[0] << 8) | ((u32_t)byBuffer[1]);

	i32_t byVar1;
	byVar1 = (g_fTempfine - ((i32_t)76800));
	byVar1 = (((((ibHumADC << 14) - (((i32_t)g_Calibration.ibDigH4) << 20) - (((i32_t)g_Calibration.ibDigH5) * byVar1)) +
	((i32_t)16384)) >> 15) * (((((((byVar1 * ((i32_t)g_Calibration.ibDigH6)) >> 10) * (((byVar1 * ((i32_t)g_Calibration.byDigH3)) >> 11) + ((i32_t)32768))) >> 10) + ((i32_t)2097152)) *
	((i32_t)g_Calibration.ibDigH2) + 8192) >> 14));
	byVar1 = (byVar1 - (((((byVar1 >> 15) * (byVar1 >> 15)) >> 7) * ((i32_t)g_Calibration.byDigH1)) >> 4));
	byVar1 = (byVar1 < 0 ? 0 : byVar1);
	byVar1 = (byVar1 > 419430400 ? 419430400 : byVar1);
	fValueHum =( (float_t)(byVar1>>12) / 1024.0)*100;
	return (u64_t)fValueHum;
}
/******************************************************************************
* @func					readFloatHumidityFromBurst
* @brief				this func read value humidity from burst
* @param				u8_t byBuffer[],
* 						BME280SensorMeasurements_t *pmeasurements
* @return				none
* @Note					none
*/
void_t readFloatHumidityFromBurst(u8_t byBuffer[], BME280SensorMeasurements_t *pmeasurements)
{

	// Set humidity in %RH as unsigned 32 bit integer in Q22. 10 format (22 integer and 10 fractional bits).
	// Output value of “47445” represents 47445/1024 = 46. 333 %RH
	i32_t ibHumADC = ((i32_t)byBuffer[6] << 8) | ((i32_t)byBuffer[7]);

	i32_t byVar1;
	byVar1 = (g_fTempfine - ((i32_t)76800));
	byVar1 = (((((ibHumADC << 14) - (((i32_t)g_Calibration.ibDigH4) << 20) - (((i32_t)g_Calibration.ibDigH5) * byVar1)) +
	((i32_t)16384)) >> 15) * (((((((byVar1 * ((i32_t)g_Calibration.ibDigH6)) >> 10) * (((byVar1 * ((i32_t)g_Calibration.byDigH3)) >> 11) + ((i32_t)32768))) >> 10) + ((i32_t)2097152)) *
	((i32_t)g_Calibration.ibDigH2) + 8192) >> 14));
	byVar1 = (byVar1 - (((((byVar1 >> 15) * (byVar1 >> 15)) >> 7) * ((i32_t)g_Calibration.byDigH1)) >> 4));
	byVar1 = (byVar1 < 0 ? 0 : byVar1);
	byVar1 = (byVar1 > 419430400 ? 419430400 : byVar1);

