ngocuong86/GY_BM280_STM32F4x/Src/Mid/BME280-pressure-temperature-sensor/BME280-pressure-temperature-sensor.c
	pmeasurements->fHumidity = (float_t)(byVar1>>12) / 1024.0;
}
/******************************************************************************
* @func					setTemperatureCorrection
* @brief				this func set temp correct
* @param				float_t fCorr
* @return				none
* @Note					none
*/
void_t setTemperatureCorrection(float_t fCorr)
{
	g_SensorSettings.fTempCorrection = fCorr;
}
/******************************************************************************
* @func					readTempC
* @brief				this func read temp with unit of meas is C
* @param				none
* @return				Value Temperature (oC*100)
* @Note					none
*/
u64_t readTempC( void_t)
{
	// Returns temperature in DegC, resolution is 0.01 DegC. Output value of “5123” equals 51.23 DegC.
	// t_fine carries fine temperature as global value

	//get the reading (adc_T);
    u8_t byBuffer[3];
    float_t fOutput;
	readRegisterRegion(byBuffer, BME280_TEMPERATURE_MSB_REG, 3);
    i32_t adc_T = ((i32_t)byBuffer[0] << 12) | ((i32_t)byBuffer[1] << 4) | ((byBuffer[2] >> 4) & 0x0F);
//
//	//By datasheet, calibrate
	i32_t ibVar1, ibVar2;

	ibVar1 = ((((adc_T>>3) - ((i32_t)g_Calibration.byDigT1<<1))) * ((i32_t)g_Calibration.ibDigT2)) >> 11;
	ibVar2 = (((((adc_T>>4) - ((i32_t)g_Calibration.byDigT1)) * ((adc_T>>4) - ((i32_t)g_Calibration.byDigT1))) >> 12) * ((i32_t)g_Calibration.ibDigT3)) >> 14;
	g_fTempfine =(float_t)ibVar1 + (float_t)ibVar2;
	fOutput = (float_t)(g_fTempfine * 5 + 128) / 256;
	fOutput =(float_t)( fOutput / 100 + g_SensorSettings.fTempCorrection)*100;
	return (u64_t)fOutput;
}
/******************************************************************************
* @func					readTempFromBurst
* @brief				this func read temp F from Burst
* @param				u8_t byBuffer[]
* @return				Value Temperature (oC)
* @Note					none
*/
float_t readTempFromBurst(u8_t byBuffer[])
{
  i32_t ibTempADC = ((u32_t)byBuffer[3] << 12) | ((u32_t)byBuffer[4] << 4) | ((byBuffer[5] >> 4) & 0x0F);

	//By datasheet, calibrate
	i16_t ibVar1, ibVar2;

	ibVar1 = ((((ibTempADC>>3) - ((i16_t)g_Calibration.byDigT1<<1))) * ((i16_t)g_Calibration.byDigT1)) >> 11;
	ibVar2 = (((((ibTempADC>>4) - ((i16_t)g_Calibration.byDigT1)) * ((ibTempADC>>4) - ((i16_t)g_Calibration.byDigT1))) >> 12) *
	((i32_t)g_Calibration.ibDigT3)) >> 14;
	g_fTempfine = ibVar1 + ibVar2;
	float_t fOutput = (g_fTempfine * 5 + 128) / 64 ;

	fOutput = fOutput / 100 + g_SensorSettings.fTempCorrection;

 	return fOutput;
}
/******************************************************************************
* @func					readTempCFromBurst
* @brief				this func read temp C from Burst
* @param				u8_t byBuffer[]
* @return				none
* @Note					none
*/
void_t readTempCFromBurst(u8_t byBuffer[], BME280SensorMeasurements_t *pmeasurements)
{
	pmeasurements->fTemperature = readTempFromBurst(byBuffer);
}
/******************************************************************************
* @func					readTempF
* @brief				this func read temp with unit of meas F
* @param				u8_t byBuffer[]
* @return				Value Temperature (F*100)
* @Note					none
*/
u64_t readTempF( void_t )
{
	float_t fOutput = readTempC();
	fOutput = (fOutput * 9) / 5 + 32;

	return (u64_t)fOutput;
}
/******************************************************************************
* @func					readTempFFromBurst
* @brief				this func read temp F from burst
* @param				u8_t byBuffer[],
* 						BME280SensorMeasurements_t *pmeasurements
* @return				none
* @Note					none
*/
void_t readTempFFromBurst(u8_t byBuffer[], BME280SensorMeasurements_t *pmeasurements)
{
  float_t fOutput = readTempFromBurst(byBuffer);
  fOutput = (fOutput * 9) / 5 + 32;

  pmeasurements->fTemperature = fOutput;
}

////****************************************************************************//
////
////  Utility
////
////****************************************************************************//
/******************************************************************************
* @func					readRegisterRegion
* @brief				this func read Data from register store data( temp, pres, humi)
* @param				u8_t *pOutputPointer ,
* 						u8_t byOffset,
* 						u8_t byLength
* @return				none
* @Note					none
*/
static void_t readRegisterRegion(u8_t *pOutputPointer , u8_t byOffset, u8_t byLength)
{
	switch(g_SensorSettings.byComInterface){
	case I2C_MODE:
		I2C1_Start();
		I2C1_AddressDirection(g_SensorSettings.byI2CAddress <<1,I2C_Direction_Transmitter);
		I2C1_Transmit(byOffset);
		I2C1_Stop();
		I2C1_Start();
		I2C1_AddressDirection(g_SensorSettings.byI2CAddress<<1, I2C_Direction_Receiver);
		for(i8_t  i = 0; i < byLength;i++){
			if(i == byLength -1){
				pOutputPointer[i] = I2C1_ReceiveNack();
			}else{
				pOutputPointer[i] = I2C1_ReceiveAck();
			}
		}
		I2C1_Stop();

		break;
	case SPI_MODE:
		break;
	}

}
/******************************************************************************
* @func					readRegister
* @brief				this func read Data from register
* @param				u8_t byOffset // value offset address register
* @return				none
* @Note					none
*/
static u8_t readRegister(u8_t byOffset)
{
	u8_t byResult = 0;
	switch(g_SensorSettings.byComInterface){
		case I2C_MODE:
			I2C1_Start();
			I2C1_AddressDirection(g_SensorSettings.byI2CAddress << 1,I2C_Direction_Transmitter);
			I2C1_Transmit(byOffset);
			I2C1_Stop();
			I2C1_Start();
			I2C1_AddressDirection(g_SensorSettings.byI2CAddress << 1, I2C_Direction_Receiver);
			byResult = I2C1_ReceiveNack();
			I2C1_Stop();
			break;
		case SPI_MODE:
			break;
		}
	return byResult;
}
/******************************************************************************
* @func					readRegisterInt16
* @brief				this func read Data from register 16bit
* @param				u8_t byOffset // value offset address register
* @return				none
* @Note					none
*/
static u16_t readRegisterInt16( u8_t byOffset )
{
	u8_t byBuffer[2];
	readRegisterRegion(byBuffer, byOffset, 2);  //Does memory transfer
	u16_t byOutput = (i16_t)byBuffer[0] | (i16_t)(byBuffer[1] << 8);
	return byOutput;
}
/******************************************************************************
* @func					writeRegister
* @brief				this func write Data to register
* @param				u8_t byOffset // value offset address register
* 						u8_t byDataToWrite
* @return				none
* @Note					none
*/
static void_t writeRegister(u8_t byOffset, u8_t byDataToWrite)
{
	switch(g_SensorSettings.byComInterface){
		case I2C_MODE:
			I2C1_Start();
			I2C1_AddressDirection(g_SensorSettings.byI2CAddress << 1,I2C_Direction_Transmitter);
			I2C1_Transmit(byOffset);
			I2C1_Transmit(byDataToWrite);
			I2C1_Stop();
			break;
		case SPI_MODE:
			break;
		}
}
/******************************************************************************
* @func					dewPointC
* @brief				this func meas dew point C
* @param				none
* @return				Dew Point C
* @Note					none
*/
u64_t dewPointC(void_t)
{
  float_t fValueDewC = 0;
  float_t celsius = (u64_t)readTempC()/100;
  float_t humidity = (u64_t)readFloatHumidity()/100;
  // (1) Saturation Vapor Pressure = ESGG(T)
  float_t RATIO = 373.15 / (273.15 + celsius);
  float_t RHS = -7.90298 * (RATIO - 1);
  RHS += 5.02808 * log10(RATIO);
  RHS += -1.3816e-7 * (pow(10, (11.344 * (1 - 1/RATIO ))) - 1) ;
  RHS += 8.1328e-3 * (pow(10, (-3.49149 * (RATIO - 1))) - 1) ;
  RHS += log10(1013.246);
         // factor -3 is to adjust units - Vapor Pressure SVP * humidity
  float_t VP = pow(10, RHS - 3) * humidity;
         // (2) DEWPOINT = F(Vapor Pressure)
  float_t T = log(VP/0.61078);   // temp var
  fValueDewC = ((241.88 * T) / (17.558 - T))*100;
  return (u64_t)fValueDewC;
}
